
##########################################################################
##                4주차 과제입니다.                                     ##
## 각 문제에 맞는 코드를 적어서 제출해주세요                            ##
##                                                                      ##
## 제출방식은 1. 파일명 >> "basic_4회차과제_이름"                       ##
##            2. 한글파일에 코드와 출력결과를 같이 첨부해주세요.        ##  
##                                                                      ##
##########################################################################


rm(ls=list(a))  # 기존에 저장된(in RAM) 변수 삭제  

setwd('')  # Woriking Directory 설정


######################################################################
#          필요한 패키지 설치 및 라이브러리 실행 코드                #
######################################################################

if(!require(stringr)) install.packages("stringr"); library(stringr)
if(!require(readr)) install.packages("readr"); library(readr)
if(!require(lubridate)) install.packages("lubridate"); library(lubridate)


#######################################################################
##                                                                   ##
## 문제 1번) 아래 busker란 변수에 저장된 문자열에서                  ## 
##           "그대여"가 총 몇 번 나오는지 알아보는 코드를 작성하세요.##
##                                                                   ##
#######################################################################  

busker = read_file('벚꽃엔딩.txt')
Encoding(busker) <- "cp949"


x<-unlist(strsplit(busker,'[\t ]'));x
a<-grep('그대여',x);a
length(a)

##################################################################################
##                                                                              ##
## 문제 2번) 아래 txt란 변수에는 로미오와 줄리엣의 대본이 저장되어있습니다      ## 
##           로미오와 줄리엣은 희곡으로 막/장으로 구분되어 있습니다(ACT/Scene). ##
##           각 장(Scene)의 장소를 추출하여 scenes라는 벡터에 저장하고          ## 
##           결과물을 아래와 같이 출력되게 보여주세요                           ##
##                                                                              ##
##################################################################################


#결과물) 
#> scenes 
#[1] "Verona. A public place."                                  
#[2] "A Street."                                                
#[3] "Capulet's house."                                         
#[4] "A street."    ...

txt <- read_file('http://www.gutenberg.org/cache/epub/1112/pg1112.txt')
Encoding(txt) <- "UTP-8"

script<-unlist(strsplit(txt,'ACT'));script
script1<-unlist(strsplit(script,'[\r\n]'));script1
script2<-grep('Scene',script1);script2
script3<-script2+2  
script4<-script1[script3]

##################################################################################
##                                                                              ##
## 문제 3번) 아래 article이란 변수에는 문자열이 저장되어있습니다.               ## 
##           article변수에서 아래와 같은 출력을 하는 코드를 작성하고            ##
##           결과물을 출력해주세요.                                             ##
##                                                                              ##
##                                                                              ##
##    ☆★ 꼭 정규 표현식을 활용한 코드를 작성해주세요 !!!!!    ★☆              ##    
###################################################################################


#결과물)
#[1] "SALAH"   "Salah"   "Sissoko" "Son"



article = read_file('article.txt')
q<-unlist(strsplit(article,'[\r\n ]'));q
w<-grep('S..',q);w
r<-q[w]
r
##################################################################################
##                                                                              ##
## 문제 4번) 아래 birthday란 변수에 본인의 생년월일을 문자열로 지정하고         ## 
##           본인이 태어난 지 몇 일 째 되는지 확인하는 코드를 작성하고          ##
##           태어난 날의 요일은 무슨 요일인지 확인하는 코드를 작성 후           ## 
##           결과물을 아래와 같이 출력되게 보여주세요                           ##
##                                                                              ##
##################################################################################

#결과물) 
# > ******** 
# Time difference of 7032 days                                 
# > ********                                                
#[1] "토요일"                                         


birthday = '20001229'
recent_time<-Sys.Date()
birthday1<-as.character(birthday)
birthday2<-as.Date(birthday1,'%Y%m%d')
difftime(recent_time,birthday2,tz="EST")
weekdays(birthday2)
